local mod = CNEIDBabel
mod:AddModTranslationLoader("Furtherance","悲恸助长(Furtherance)\n 警告: 目前该模组汉化仅完成了基础部分, 若有发现汉化与实际效果对不上, 请及时反馈",function()
    --24年9月就有人问能不能将这个模组加入IsaacGuru, 至今没有反应, 所以这个EID汉化估计不会特别多的附赠内容
    --有github维基, 但内容没那么多, 关于道具之间的兼容欢迎各位投稿
    --维基甚至只有一个角色
    local items={
        {--以撒的键盘 系列道具
            "Esc Key",
            "退出键",
            "我先溜了",
            "如果角色少于6颗心, 用{{Heart}} {{SoulHeart}}治疗角色#将角色传送至房间外面"
        },{
            "Tilde Key",
            "飘号键",
            "小开不算开",--原文: 你个肮脏的作弊者
            "在当前房间内获得一个随机的debug效果"
        },{
            "Alt Key",
            "Alt键",
            "真实",
            "正常楼层会变为变种楼层#变种楼层会变回普通楼层"
        },{
            "Spacebar Key",
            "空格键",
            "反馈循环",
            "将角色传送至错误房"
        },{
            "Backspace Key",
            "退格键",
            "不! 回去!",
            "打开角色进入房间时的门"
        },{
            "Q Key",
            "Q键",
            "白嫖",
            "{{Collectible348}}安慰剂, {{Collectible286}}空白卡片和{{Collectible263}}透明符文的三合一版本, 用于免费触发持有的副手道具",
        },{
            "E Key",
            "E键",
            "瞬爆",
            "生成一个究极炸弹",
        },{
            "C Key",
            "C键",
            "支持Encyclopedia!",--双关, 该词意为百科全书, 同时也是一个兼容的图鉴mod
            "将角色传送至{{Library}}图书馆, 里面包含5本书"
        },{
            "Caps Key",
            "大写锁定",
            "体积锁定",
            "使角色在当前房间内变大#角色可以撞碎障碍物#↑ {{Damage}} 伤害+7#↑ {{Range}} 射程+3"
        },{
            "Enter Key",
            "回车键",
            "相遇再无界限",
            "尝试打开头目车轮战的门#{{Timer}} 无视游戏时间"
        },{
            "Shift Key",
            "Shift键",
            "暂时性攻击上升",
            "↑ {{Damage}} 伤害+15#在一分钟内流失"
        },{--占星符号 系列道具
            "Ophiuchus",--哈哈跟邪魔典纸同名甚至贴图都是一个         不过贴图如果不是一个才有鬼吧
            "蛇夫座",
            "共同的梦",
            "↑ {{Tears}} 射速+0.4#↑ {{Damage}} 伤害+0.3#↑ {{SoulHeart}} 魂心+1#波浪弹道#灵体泪弹"
        },{
            "Chiron",
            "凯龙星",
            "最是聪慧公正",
            "↑ {{Speed}} 移速+0.2#{{Collectible333}} 进入新楼层会获得一个随机的小地图效果#{{Library}} 进入头目房会触发一本书的效果"
        },{
            "Juno",
            "婚神星",
            "万物法则",
            "↑ {{SoulHeart}} 魂心+2#{{Collectible722}} 泪弹命中敌人有概率锁住最近的敌人5s"
        },{
            "Pallas",
            "智神星",
            "岁月风霜",--机翻
            "泪弹会在滞空一段事件后在地面上跳动#每次跳动造成溅射伤害#↑ {{Tearsize}} 泪弹体积+20%"
        },{
            "Ceres",
            "谷神星",
            "随生命闪动",
            "↑ {{Damage}} 伤害+0.5#泪弹命中敌人有概率让角色产生绿色液迹#走上绿色液体的敌人会被减速并出现触手攻击#触手也会减速敌人"
        },{
            "Vesta",
            "灶神星",
            "肉眼隐约可见",
            "↑ {{Damage}} 伤害+50%#泪弹变得非常小#泪弹获得灵体和微透明#泪弹有概率一分为四"
        },{
            "Tech IX",
            "科技9",--如果照这么翻译的话科技X其实该叫做科技10
            "蓄力激光环测试版",
            "泪弹改为发射小型激光环#不同于{{Collectible395}}, 该攻击无需蓄力#↓ {{Tears}} 射速-0.85"
        },{
            "Leaking Tank",
            "漏罐",
            "我漏了?!",
            "剩余一颗心时, 角色会留下绿色液体"
        },{
            "Unstable Core",
            "不稳定核心",
            "霹雳主动",
            "每次使用主动道具, 朝周围释放电击#{{Burning}} 电击会灼烧敌人3s"
        },{
            "Technology -1",
            "科技-1",
            "下溢射击",
            "泪弹随机迸为3向激光"
        },{
            "Book of Swiftness",
            "迅捷之书",
            "暂时性移速上升",
            "减速敌人#↑ {{Speed}} 移速+0.5#↓ {{Shotspeed}} 弹速-1#效果持续一个房间"
        },{
            "Book of Ambit",
            "范围之书",
            "暂时性射程上升",
            "↑ {{Range}} 射程+5#↑ {{Shotspeed}} 弹速+1.5#使用后获得穿透泪弹"
        },{
            "Plug N' Play",
            "即插即用",
            "自带1000多款游戏!",
            "{{ERROR}} 生成一个错误道具"
        },{
            "ZZZZoptionsZZZZ",
            "锟斤拷选项锟斤拷",
            "锟斤拷更锟斤拷多锟斤拷",
            "{{TreasureRoom}} 所有宝箱房生成2个道具#可以选择其中一个#其中一个为错误道具, 并会出现在房间内的随机位置"
        },{
            "Brunch",
            "早午餐",
            "生命 + 弹速上升",
            "↑ {{Heart}} 心之容器+2#↑ {{Shotspeed}} 弹速+0.16#治疗1红心"
        },{
            "Crab Legs",
            "螃蟹腿",
            "\"横\"行霸道",--原文: 你没法让螃蟹直着走路   感觉像个外国俚语, 但是没想到怎么翻译好(
            "↑ {{Heart}} 心之容器+1#↑ {{Speed}} 朝左或右移动时获得移速+0.2#治疗1红心"
        },{
            "Owl's Eye",
            "猫头鹰的眼镜",
            "大师会指引你",
            "有概率发射2倍伤害的追踪穿透泪弹"
        },{
            "Shattered Heart",
            "破裂之心",
            "永恒悲恸",
            "{{BrokenHeart}} 移除一个碎心#在有敌人的房间时缓慢获得{{BrokenHeart}}, 至多11个#{{BrokenHeart}} 在靠近敌人时会快速移除碎心#攻击时有概率发射魅惑泪弹, 并生成黑色减速液体"
        },{
            "Pharaoh Cat",
            "法老之猫",
            "棱锥泪弹",
            "↓ {{Tears}} 射速-1.76#泪弹呈棱锥形状"
        },{
            "F4 Key",
            "F4键",
            "小心...",
            "根据角色持有的最少的物资, 将角色传送至另一个未探索过的特殊房间#硬币: {{ArcadeRoom}}#炸弹: {{SuperSecretRoom}}, {{IsaacsRoom}}, {{SecretRoom}}#钥匙: {{Shop}}, {{TreasureRoom}}, {{DiceRoom}}, {{Library}}, {{ChestRoom}}, {{Planetarium}}"
        },{
            "Tab Key",
            "Tab键",
            "特别好用!",
            "使用后透视全图#触发{{Card74}}逆位月亮的效果"
        },{
            "Heart Renovator",
            "心脏修复",
            "永恒胜利",
            "{{BrokenHeart}} 使用后, 移除1碎心#↑ 成功移除一个碎心则获得伤害+0.1#{{Heart}} 拥有一个红心计数器以储存多余的红心#{{BrokenHeart}} 双击丢弃键以消耗2计数器获得+1{{BrokenHeart}}"
        },{
            "Parasitic Poofer",
            "寄生胀血团",
            "它爱你",
            "受伤时, 20%的概率翻倍角色的红心并+1{{BrokenHeart}}#仅有治疗效果"
        },{
            "Butterfly",
            "蝴蝶",
            "失去所爱之人",--怎么办我想翻译成原来我是一只酒醉的蝴蝶
            "受到伤害会使角色朝随机方向发射泪弹2s#这些泪弹造成角色一半的伤害"
        },{
            "Spiritual Wound",
            "精神攻击",
            "榨干他们的精神力",
            "攻击方式替换为数个细激光#角色可以控制一个准心, 激光会瞄准准心, 追踪最靠近的敌人直至死亡#准心会自动移向最近的敌人#{{Damage}} 每次判定造成33%的伤害#被杀死的敌人有5%的概率掉落{{HalfHeart}}"
        },{
            "Caduceus Staff",
            "墨丘利之使",
            "生命上升, 你感觉很棒!",
            "{{SoulHeart}} 魂心+2#有概率抵消受到的伤害并获得一个护盾#概率初始为1%, 每次受伤后翻倍"
        },{
            "Polydipsia",
            "烦渴症",
            "眼泪下降?!",
            "抛物线弹道#泪弹命中地板, 障碍物或敌人会迸裂为一滩水#↓ {{Tears}} 射速下降大约-100%"--这么玩会死的吧
        },{
            "Kareth",
            "卡雷斯之匕",--存疑
            "神罚",
            "本局剩余时间内, 遇到的所有道具变为1-3个饰品#数量具体取决于道具品质#自动吞下拾取的所有饰品"
        },{
            "Pillar of Fire",
            "圣火之柱",
            "前途一片光明",
            "受伤后有概率迸射5个火焰, 对敌人造成伤害#火焰持续朝敌人发射血泪"
        },{
            "Pillar of Clouds",
            "浓云之柱",
            "前途乌云密布",
            "穿过一扇通往未清理的房间的门将有概率跳过它并来到下一个房间"
        },{
            "Firstborn Son",
            "长子",
            "飞速伙伴",
            "立刻追击并杀死房间内生命值最高的敌人 的跟班"
        },{
            "Miriam's Well",
            "米利暗之井",
            "喷涌而出",
            "被攻击后喷射并生成一滩水迹的环绕物"
        },{
            "Quarantine",
            "隔离",
            "保持距离",
            "{{Fear}} 进入新房间后对所有敌人施加恐惧6s#{{Poison}} 期间靠近角色的敌人会中毒"
        },{
            "Book of Guidance",
            "引导之书",
            "大迁徙结束",--机翻
            "在当前楼层内打开所有的门"
        },{
            "Jar of Manna",
            "吗哪之罐",--吗哪为古以色列人经过荒野时所得的天赐食粮
            "装满了信仰",
            "杀死敌人会生成会迅速消失的吗哪珠#可以收集这些吗哪珠#使用以提供角色拥有的最少的物资"
        },{
            "Tambourine",
            "手鼓",
            "咯咯作响!",
            "原地制造一个漩涡#漩涡会吸引附近的掉落物和敌人并造成伤害"
        },{
            "The Dreidel",
            "四面陀螺",
            "元素重随",
            "↓ 减少1-4个随机属性, 生成当前房间道具池的随机道具#道具品质取决于减少的属性数量"
        },{
            "Apocalypse",
            "天启灾兆",
            "末日降临",
            "↓ 移除所有的被动道具#↑ 每移除一个道具获得2个随机属性提升"
        },{
            "Keys to the Kingdom",
            "王国之钥",
            "神圣控制 + 救赎之力",
            "{{Room}} \"饶恕\"所有敌人并将它们送走, 在当前楼层内获得属性提升#{{BossRoom}} 开始一个30s计时器, 期间头目不受到伤害即可被饶恕, 为角色提供永久属性提升#{{DevilRoom}} 所有道具变为免费#{{AngelRoom}} 生成一个钥匙碎片#{{Blank}} 注意: 合成了完整的钥匙后只会生成天使#有概率通过杀死敌人获得充能"
        },{
            "Muddled Cross",
            "混乱十字架",
            "倒反天罡",
            "上下颠倒屏幕并染红#改变楼层样式#↑ 颠倒状态下, 所有道具和掉落物翻倍#所有道具变为{{ItemPoolUltraSecret}}#!!! 颠倒状态下每7s失去{{HalfHeart}}#{{GarlinIcon}} 不会影响魂心, 且无论如何始终会留下半个红心#{{GarlinIcon}} 如果渲染有点问题, 可以尝试在全屏下游玩"
        },{
            "Old Camera",
            "老旧相机",
            "用照片将记忆保存",
            "\"保存\"当前房间#再次使用以将角色带回保存的房间并再清理一次"
        },{
            "Alternate Reality",
            "备用真实",--存疑
            "万物",
            "将角色传送至随机楼层#!!! 角色会被安置在楼层内的随机房间#↑ 揭示当前楼层的地图#!!! 有可能传送至蓝子宫"
        },{
            "Wine Bottle",
            "酒瓶",
            "砰!",
            "每15发攻击发射一个具有两倍伤害的高弹速大瓶塞"
        },{
            "Heart Embedded Coin",
            "心形镶嵌硬币",
            "爱的象征",
            "无法拾取红心时会将其变为硬币"
        },{
            "Mandrake",
            "曼德拉草",
            "莨菪烷生物碱",--我赌这东西绝对字体不兼容
            "{{TreasureRoom}} 所有宝箱房包含2个道具#只能选择其中一个#第二个道具必定为跟班"
        },--[[{
            "Little Sister",
            "小妹妹",
            "凶恶的竞争力",
            "该道具隶属于隐藏道具, 效果不明"
        }]]{
            "Flux",
            "通量",
            "连贯性",--存疑
            "↑ {{Range}} 射程+9.75#灵体泪弹#同时朝角色后方发射泪弹#泪弹只有在角色移动时移动#反向发射的泪弹运动方向相反"
        },{
            "Cosmic Omnibus",
            "宇宙精选集",
            "飞跃天国",
            "随机传送至一个特殊房间#{{Planetarium}} 30%的概率传送至一个新生成的星象房"
        },{
            "Little Raincoat",
            "小小雨衣",
            "化身噩梦",--反之梦魇又是字体不兼容
            "每受到6次攻击获得类似{{Pill}}大力丸的效果#6%的概率重随食物道具#体型下降"
        },{
            "Blood Cyst",
            "血囊肿",
            "要爆浆了",
            "进入未清理的房间会在随机区域生成血囊肿#攻击或践踏会使其迸裂8向泪弹"
        },{
            "Polaris",
            "北极星",
            "愿星辰闪闪发光",
            "在未清理的房间中会在五种随机颜色中切换的跟班#根据当前的颜色获得属性的↑增幅或↓减益, 和额外的泪弹效果"
        },{
            "D9",
            "九面骰",
            "重随你的旅途",
            "{{Trinket}} 重随当前房间内的饰品"--这种设计还是太容易重复了(悲)
        },--[[{
            "Leah's Hair Tie",
            "利亚的发圈",
            "系好你的头发",
            "{{BrokenHeart}} 碎心+1#杀死敌人有概率获得碎心, 概率会基于角色拥有的碎心而下降#↑ 每3个房间移除1碎心, 并获得2个衰减的属性提升"
        },{
            "Leah's Torn Heart",
            "利亚撕裂的心脏",
            "",
            "{{BrokenHeart}} 碎心+1#↑ 每个碎心提供小幅度全属性提升#每层+1碎心#15%的概率令机器变为忏悔室"
        },{
            "Peter's Headband",
            "彼得的头巾",
            "",
            "↑ {{Key}} 钥匙+1#每12个房间, 当前房间内的所有敌人将被销魂#↑ 销魂可以获得随机的暂时性属性提升#↑ 对头目生效"
        },{
            "Peter's Bloody Fracture",
            "彼得的血裂",--存疑, 不过反正是隐藏道具
            "",
            "拾取后触发混沌十字架的效果#每6个房间上下颠倒"
        },{
            "Miriam's Headband",
            "米利暗的头巾",
            "",
            "{{Tears}} 射速+1#攻击会蓄力一波漩涡攻击#漩涡攻击是烦渴症的强化版本"
        },{
            "Miriam's Putrid Veil",
            "米利暗的溃烂面纱",
            "",
            "{{Range}} 泪弹高度-2#杀死敌人后5%的概率生成{{HalfHeart}}#敌人每次受伤后3s都会持续受到20%的面板伤害"
        },]]
        {
            "Book of Books",
            "书之书",
            "读不完的书!",
            "一次性触发所有的书本道具#对模组书本有效"
        },{
            "Keratoconus",
            "锥形眼角膜",
            "温柔凝视之眼",--机翻
            "↑ {{Range}} 射程+0.2#↓ {{Shotspeed}} 弹速-0.5#有概率发射一束圣光泪弹, 伴随一个光环缩水或助长敌人"
        },{
            "Servitude",
            "奴役",
            "7年劳役",
            "最近的道具底座下方出现一个标记#使用以在角色下方生成一个7开始的计数器#无伤清理房间以叠加进度#↑ 成功后获得那个道具的复制#↓ 受伤将会重置计数器并+1{{BrokenHeart}}"
        },{
            "Cardiomyopathy",
            "心肌症",
            "胸部剧痛",
            "↑ 填满一个心之容器会获得暂时的无敌#拾取{{Heart}}红心有概率获得空的心之容器, 概率取决于幸运#{{BoneHeart}} 所有骨心被替换为空的心之容器"
        },{
            "Sunscreen",
            "防晒霜",
            "解暑秘方",
            "↑ 免疫火焰伤害"
        },{
            "Secret Diary",
            "秘密日记",
            "没人知道",
            "{{Collectible619}} 在当前房间获得长子权"
        },{
            "D16",
            "十六面骰",
            "重随你的生命",
            "重随角色的生命值",
            {CHAR={14,"Keeper16",true}}
        },{
            "Binds of Devotion",
            "虔诚的束缚",--机翻
            "为爱所困",
            "{{Player19}} 生成雅阁作为副角色, 类似{{Collectible667}} 稻草人"
        },{
            "Iron",
            "熨斗",
            "炙手可热",
            "↑ 熨斗环绕物, 将经过的角色泪弹{{Tearsize}} {{Damage}}翻倍并获得{{Collectible257}}火焰附加效果"
        },{
            "Rotten Apple",
            "烂苹果",
            "随机蠕虫 + 伤害上升",
            "拾取后永久获得一个随机的蠕虫饰品效果#↑ {{Damage}} 伤害+2"
        },{
            "Beginner's Luck",
            "新人好运礼包",
            "衰减的幸运",
            "↑ {{Luck}} 每层获得幸运+10#↓ 每个房间-1{{Luck}}, 直至回到基础值"
        },{
            "Dad's Wallet",
            "爸爸的钱包",
            "父亲的财富",
            "拾取后生成2张特殊卡牌"
        },{
            "Chi Rho",
            "凯乐符号",
            "科技!",
            "激光现在会追踪敌人#{{Collectible222}} 它们在发射出去时会固定#!!! 若攻击方式不为激光则无效"
        },{
            "Leah's Heart",
            "利亚的心脏",
            "她的心脏在跳动",
            "↑ {{Damage}} 伤害+120%#使用主动道具后拾取伤害增幅, 并获得1{{SoulHeart}}和屏障#进入下一层恢复伤害增幅"
        },{
            "Pallium",
            "大披肩",
            "权力",
            "清理房间获得1-3个迷你以撒#这些迷你以撒只会持续一层"
        },{
            "Cold Hearted",
            "心寒",
            "寒冰之触",
            "{{Freezing}} 冻结触碰的敌人",
        },{
            "Rotten Love",
            "腐烂之爱",
            "生命上升?",
            "生成2-3个{{RottenHeart}}和2-3个{{EmptyBoneHeart}}"
        },{
            "Rue",
            "悔意",--存疑
            "爱之毁灭",
            "受伤后朝最近的敌人发射激光柱#没有敌人则瞄准随机方向"
        },{
            "Exsanguination",
            "放血",
            "更稀有的心",
            "{{Heart}} 任何心生成的概率-50%#↑ 每次拾取心都会获得永久的+0.1{{Damage}}"
        },{
            "Prayer Journal",
            "祷告日志",
            "经文",
            "90%的概率获得{{SoulHeart}}/{{BlackHeart}}, 10%的概率获得{{BrokenHeart}}"
        },{
            "Book of Leviticus",
            "利未记",
            "一成不变",
            "生成6簇随机石头和障碍物#通常包含标记石头"
        },{
            "Molten Gold",
            "熔融的黄金",
            "这样就更值钱了",
            "受到伤害有25%的概率触发随机符文的效果"
        },{
            "Trepanation",
            "环钻术",
            "血液炮弹",
            "{{Collectible531}} 每15发攻击发射一个2倍伤害的大血泪"
        },{
            "Astragali",
            "黄芪",--读作qi二声
            "重随你的喊价",
            "重随房间内的箱子",
        },{
            "Liberation",
            "解放",
            "摆脱世俗之缚",
            "杀死敌人有5%的概率获得飞行, 并打开当前房间内的所有门"
        },{
            "Severed Ear",
            "断耳",
            "战争挂彩",
            "↑ {{Damage}} 伤害倍率x1.2#↓ {{Tears}} 射速倍率x0.8#↑ {{Range}} 射程+1.2#↓ {{Shotspeed}} 弹速-0.6"
        },{
            "Golden Port",
            "金插座",
            "金币充能",
            "当主动道具充能未满时, 可以花费5美分获得6点充能"
        },{
            "Itching Powder",
            "痒痒粉",
            "双倍伤害?",
            "受到伤害后1s再受到一次假伤"
        },{
            "Polarity Shift",
            "两极反转",
            "???",
            "{{CurseBlind}} 若杀死敌人后可以治疗米利暗, 为该道具充能(存疑)#!!! 无法通过电池或清理房间获得充能#使用后, 当前房间内米利暗的攻击方式切换为闪电鞭#闪电鞭的第一段判定瞬间造成2倍伤害, 随后持续减少至角色15%的伤害"--要不是我去代码里翻到了批注然后去搞了翻译外人还怎么知道这东西什么效果
        }
    }
    local trinkets={
        {
            "Holy Heart",
            "圣洁之心",--什么东西都叫圣心你让我真圣心怎么搞
            "保护之心",
            "拾取心掉落物时有小概率获得护盾"
        },{
            "Cringe",
            "反感脸",
            "正在发送",--存疑
            "受到伤害后, 房间内的所有敌人被冻结一小段时间#↑ 替换角色的受伤音效"
        },{
            "Slick Worm",
            "滑溜虫",
            "我滑-----",
            "泪弹打到墙上会朝敌人的方向弹射"
        },{
            "Grass",
            "草",
            "去碰一下",--存疑
            "{{Timer}} 开始1小时计时#时间到后移除该饰品并获得{{Collectible210}}#!!! 丢弃饰品会重置计时"
        },{
            "Alabaster Scrap",
            "白玉香膏的废料",
            "FT",--未知
            "↑ 每个持有的天使道具提供伤害+0.5"
        },{
            "Leah's Lock",
            "利亚的石头",
            "没有付出? 没有收获",
            "25%的概率发射魅惑/恐惧泪弹"
        },{
            "Abyssal Penny",
            "深海硬币",
            "财富即一氧化二氢",
            "{{Collectible178}} 拾取硬币时生成水迹"
        },{
            "Saline Spray",
            "盐水喷雾",
            "盐水泪弹",
            "{{Freeze}} 泪弹有5%的概率为冰冻泪弹",--额盐跟冰有联系吗?
        },{
            "Almagest Scrap",
            "天文学大成残页",
            "绘制星图",
            "将道具房替换为{{Planetarium}}#星象房的道具现在需要花费1-3个碎心#价格取决于道具品质"
        },{
            "Wormwood Leaf",
            "菌陈之叶",
            "尝起来有点辣",
            "2%的概率抵挡任何直接伤害角色的攻击#短暂石化且无法移动"
        },{
            "Altruism",
            "利他主义",
            "慈善之佑",
            "↑ 为任意乞丐捐钱有概率治疗{{HalfHeart}}或者回本"
        },{
            "Nil Num",
            "空数值",
            "Q",
            "受伤后有2%的概率生成一个已有道具的复制#然后失去该饰品"
        },{
            "BI-84",
            "BI-84",
            "",
            "每个房间有25%的概率获得随机科技道具"
        },{
            "Glitched Penny",
            "故障硬币",
            "财富即数据损坏",
            "每拾取1硬币有25%的概率触发随主动道具的效果"
        },{
            "Escape Plan",
            "走为上计",
            "一旦局势恶化",
            "受伤后有10%的概率传送至初始房间"
        },{
            "Epitaph",
            "墓志铭",
            "汝将铭记此名",
            "持有该饰品死亡后, 会在下一局的当前楼层生成一个碑石#炸3次回生成3-5个硬币, 2-3个钥匙和 那一局的第一个和最后一个道具 的复制"
        },{
            "Leviathan's Tendril",
            "利维坦的触须",
            "操作深渊浪潮之须",
            "↑ 25%的概率排斥敌弹#10%的概率恐惧靠近的敌人#{{Blank}}#{{Leviathan}} 若角色拥有利维坦套装则使概率+5%"
        },{
            "Key to the Pit",
            "深井之钥",
            "释放地底大火",
            "{{ChallengeRoom}} 允许角色无视生命值进入挑战房"
        },{
            "Parasol",
            "阳伞",
            "小小保护者",
            "↑ 所有跟班均可抵挡敌弹"
        }
    }
    local cards={
        {
            "Soul of Leah",
            "利亚的魂石",
            "心痛",
            "{{BrokenHeart}} 当前楼层内每有一个未清理的房间, 获得1碎心#↑ 每个碎心提供+0.75{{Damage}}#!!! 可能会致死"
        },{
            "Soul of Peter",
            "彼得的魂石",
            "你的世界, 再获生机",
            "↑ 生成至多5个随机的新房间#在地图上揭示它们的位置"
        },{
            "Soul of Miriam",
            "米利暗的魂石",
            "淹没",
            "在未清理的房间下雨并积水弥漫整个房间#积水每0.5s造成角色33%的伤害#效果持续40s"
        },{
            "Two of Shields",
            "护盾2",
            "物品翻倍",
            "{{Battery}} 主动道具的充能翻倍"
        },{
            "Ace of Shields",
            "护盾王牌",
            "全部转换",
            "{{Battery}} 将所有掉落物, 箱子和非头目敌人变为迷你电池"
        },{
            "Trap Card",
            "陷阱卡",
            "决斗时刻",
            "↑ 锁住最近的敌人5s"
        },{
            "Key Card",
            "钥匙卡",
            "高级通道",
            "{{Shop}} 生成一个通往具有特殊库存的第二个商店的暗门"
        },{
            "Golden Card",
            "金卡牌",
            "???",
            "{{Card}} 触发随机卡牌的效果#使用数次后消耗"
        },{
            "Essence of Love",
            "爱之精华",
            "爱之入骨",
            "{{Charm}} 暂时魅惑房间内的所有敌人"
        },{
            "Essence of Hate",
            "恨之精华",
            "悔恨莫及",
            "{{BrokenHeart}} 增加至拥有11碎心#↑ 每获得一个碎心则生成一个随机掉落物"
        },{
            "Essence of Life",
            "生之精华",
            "生死之间",
            "房间内的每有一个怪物生成一个迷你以撒"
        },{
            "Essence of Death",
            "死之精华",
            "亘古永恒",
            "↑ 杀死房间内的所有非头目敌人#↑ 每杀死一个敌人获得一个苍蝇环绕物"--存疑
        },{
            "Essence of Prosperity",
            "繁之精华",
            "比上有余",
            "在每个敌人头顶下雨#下雨每次造成66%角色伤害, 并{{Slow}} 减速5s"
        },{
            "Essence of Drought",
            "涸之精华",
            "比下不足",
            "{{BleedingOut}} 所有非头目敌人流血#{{Freeze}} 这些敌人死亡后被冻结"
        },{
            "Hope",
            "XXIII - 希望",
            "愿君前程似锦",
            "当前房间内杀死敌人有概率生成掉落物"
        },{
            "ReverseHope",
            "XXIII - 希望?",
            "浮生不祥之兆",
            "将角色传送至额外的挑战房"
        },{
            "Faith",
            "XXV - 信仰",
            "愿君得以救赎",
            "{{Confessional}} 生成一个忏悔室"
        },{
            "ReverseFaith",
            "XXV - 信仰?",
            "愿君放弃抵抗",
            "生成2个月之心"
        },{
            "Charity",
            "XXIV - 慈善",
            "助人各取所需",
            "{{Collectible"..Isaac.GetItemIdByName("Jar of Manna").."}} 使用三次吗哪之罐, 为角色提供最需要的掉落物#↑ 如果没有急需的掉落物则提供属性提升"
        },{
            "ReverseCharity",
            "XXIV - 慈善?",
            "一切都有代价",
            "翻倍房间内的所有掉落物#被翻倍的掉落物需要花钱"
        }
    }
    local pill={
        {
            Isaac.GetPillEffectByName("Heartache Up"),
            "心痛上升",
            "↓ 增加一个{{BrokenHeart}}"
        },{
            Isaac.GetPillEffectByName("Heartache Down"),
            "心痛下降",
            "↑ 移除一个{{BrokenHeart}}"
        }
    }
    local conditionalList={
        Keeper16="排空至多2硬币心, 并生成对应数量的掉落物"
    }
    mod:AddToConditionalList(conditionalList)
    local other={
        {
            EntityType.ENTITY_PICKUP, PickupVariant.PICKUP_HEART, 225,
            "月之心",
            "{{Heart}}#用尽后将角色传送至隐藏房#!!! 一次只能持有一个"
        }
    }
    for _, item in ipairs(items) do
        mod:AddTranslate(100, item[1], item[2], item[3], item[4], item[5])
    end
    for _, item in ipairs(trinkets) do
        mod:AddTranslate(350, item[1], item[2], item[3], item[4], item[5])
    end
    for _, item in ipairs(cards) do
        mod:AddTranslate(300, item[1], item[2], item[3], item[4], item[5])
    end
    for _, item in ipairs(pill) do
        mod:AddTranslate(70,item[1],item[2],"empty",item[3],item[4])
    end
    for _, item in ipairs(other) do
        mod:AddEntityTransl(item[1],item[2],item[3],item[4],item[5])
    end
    EID:addCharacterInfo(Isaac.GetPlayerTypeByName("Leah", false),"{{Heart}} 杀死敌人有概率掉落胆小的红心#{{Range}} 碎心越多, 射程越高","利亚","zh_cn")
    EID:addBirthright(Isaac.GetPlayerTypeByName("Leah", false), "↑ 红心计数器上限变为999#每杀死10个敌人-1{{BrokenHeart}}#{{CurseBlind}} 这将获得{{Collectible"..Isaac.GetItemIdByName("Shattered Heart").."}}能提供的一半的属性(实测为100%的属性)", "利亚-再爱一次", "zh_cn")
    EID:addCharacterInfo(Isaac.GetPlayerTypeByName("Leah", true),"{{BlackHeart}} 无法获得心之容器#!!! 靠近敌人时, 大幅度降低{{Tears}}射速, 并迅速清除碎心#{{GarlinIcon}} 请不要混淆, 角色射速与碎心数量无关#{{Speed}} 碎心越多, 移速越少#正常情况下无法永久移除碎心","利亚-缺爱者","zh_cn")
    EID:addBirthright(Isaac.GetPlayerTypeByName("Leah", true),"{{CurseBlind}} 远离敌人后不再持续恢复至11{{BrokenHeart}}的状态, 而是恢复6个(存疑)#{{Speed}} 碎心不再减少移速, 反而使其增加#↑ 魅惑敌人的概率+20%","利亚-再度轻视","zh_cn")
    --Leah来自犹太教-基督教传统的重要角色--圣经中雅阁的未被爱慕的妻子. 主赐予利亚六个儿子和一个女儿, 她的六个儿子成为了十二个以色列部落中的六个代表, 代表着利亚开局携带的6美分
    --Leah的初始攻击力未 3.14 因为anchikai喜欢圆周率
    EID:addBirthright(Isaac.GetPlayerTypeByName("Peter",false), "↑ 饶恕所需时间减半#↑ 饶恕头目可以获得3个永久属性提升", "圣彼得-饶恕上升", "zh_cn")
    EID:addCharacterInfo(Isaac.GetPlayerTypeByName("Peter",true),"!!! 无法拾取{{SoulHeart}}{{BlackHeart}}#{{Collectible703}} {{ColorRed}}因此, 试图使用小以扫会导致直接死亡!{{CR}}(神必模组伯大尼都知道做小以扫兼容)","圣彼得-殉道者","zh_cn")
    EID:addBirthright(Isaac.GetPlayerTypeByName("Peter",true), "↑ 颠倒状态下生命流失速度减半", "圣彼得-病理出血", "zh_cn")
    --堕化圣彼得的称号是我杜撰的, 维基的版本太老以至于没有这个角色的描述, 此处根据下文编造了这一称号
    --圣伯多禄(拉丁语Petre, 又叫圣彼得),生在 加利利 的 伯赛大, 是耶稣的大弟子, 也是耶稣最喜爱的得意门生, 为基督教早期领袖, 公元65年, 受到罗马皇帝尼禄的迫害, 被倒钉上了十字架而殉道。
    EID:addCharacterInfo(Isaac.GetPlayerTypeByName("Miriam",false),"攻击方式为抛射水球, 水球落地生成伤害液体#有概率产生漩涡","米利暗","zh_cn")
    EID:addBirthright(Isaac.GetPlayerTypeByName("Miriam",false), "↑ 米利暗的泪弹产生的伤害液体范围增大25%#靠近的被命中的敌人会被强力击退", "米利暗-破坏之洋", "zh_cn")
    EID:addCharacterInfo(Isaac.GetPlayerTypeByName("Miriam",true),"攻击方式替换为数个细激光#角色可以控制一个准心, 激光会瞄准准心, 追踪最靠近的敌人直至死亡#准心会自动移向最近的敌人#{{Damage}} 每次判定造成33%的伤害#杀死敌人有概率获得治疗","米利暗-神罚者","zh_cn")
    EID:addBirthright(Isaac.GetPlayerTypeByName("Miriam",true), "↑ 激光会一次瞄准所有敌人#{{Blank}} 伤害将会均匀分布#{{Blank}} 准心瞄准一个敌人会将大多数伤害集中于此", "米利暗-夺命之域", "en_us")
    --堕化米利暗的称号是我杜撰的, 维基的版本太老以至于没有这个角色的描述, 此处根据下文编造了这一称号
    --后来，她与亚伦因为不满摩西娶了一个古实女子，就毁谤他，因而被神惩罚她患上麻疯。 亚伦和 摩西为她哀求耶和华"神阿，求你医治她。"(El nah refa nah-la), 于是在7天后得到复原。(民数记 12)。
end)
