local mod = CNEIDBabel
mod:AddModTranslationLoader("LNF","迷失与遗忘",function()
    if LNF then
        local items={
            {
                "Conscience",
                "良知",
                "你对一切感到后悔",
                "↓ {{Damage}} -0.5伤害#↑ {{ColorError}}角色的伤害会随时间上升, 至多为原本的2倍{{CR}}#杀死怪物会重置伤害增益"
            },{
                "Math Problem",
                "数学难题",
                "我不道啊",
                "{{Damage}} 角色的攻击力在0.5x - 1.7x间随机变化"
            },{
                "Broken Hourglass",
                "坏掉的沙漏",
                "时间控制",
                "↓ {{Shotspeed}}-0.3 弹速#{{Slow}} 角色停止移动或攻击时减速所有敌人",--可是我为什么不选择叶子呢
            },{
                "Syrup",
                "糖浆",
                "药用",
                "{{Pill}} 药丸获得一个额外的随机效果#拾取后, 生成随机药丸",
                {CONF={{75,46,303,654},"SyrupChange"}}
            },{
                "Shampoo",
                "洗发剂",
                "啊我的眼镜!",
                "{{ArrowUp}} {{Tears}}+0.15 射速#泪弹变为泡泡, 泡泡会在一段时间后迸射泪弹#角色攻击时有概率发射多个泡泡#迸射的泪弹加速度方向与角色攻击方向相同"
            },{
                "Small Knives",
                "小刀",
                "发射尖刀",
                "{{ArrowUp}} {{Damage}}+0.7 伤害#{{ArrowUp}} {{Shotspeed}}+0.1 弹速#泪弹变为穿透飞刀#杀死敌人会生成跟随飞刀的血泪"
            },{
                "Parasite Eggs",
                "寄生虫卵",
                "侵袭泪弹",
                "10% 的概率发射寄生虫卵#寄生虫卵命中敌人会生成蛆虫, 在敌人间不断跳跃并造成伤害#{{Luck}} 幸运12: 40%",
                {CONF={52,"ParaditeBomb"}}
            },{
                "Ancient Technology",
                "远古科技",
                "时间的残片",
                "攻击时额外发射两束激光#激光与正常弹道朝向相同, 但会朝远离弹道的方向移动#{{Damage}} 造成20%的面板伤害",
                {CONF={
                    {{395,329},"AncientX"},
                    {{118,68},"AncientGreatTech"},
                    {114,"KnifeTech"},
                    {579,"AncientSword"}
                }}
            },{
                "Hydrosis",
                "多汗体质",
                "起!",--存疑
                "打空的泪弹会变为水滴跟班#水滴跟班会追击敌人,{{Damage}}造成25%的面板伤害, 或一段时间后消失#兼容诸如穿透, 跟踪, 泪弹特效等",
                {CONF={
                    {540,"HydroStone"},
                    {532,"LauSis"}
                }}
            },{
                LNF.CollectibleType.MEGAPHONE,
                "扩音器",
                "大点声",
                "当敌弹靠近角色时, 释放声波摧毁敌弹并推开敌人#冷却时间4s"
            },{
                "Wellingtons",
                "高筒靴",
                "溅起水花",--雨天笑传之踩踩水
                "在房间内的随机位置落下大水珠, 制造水洼#踩水洼可以迸射泪弹"
            },{
                "Mutation",
                "突变",
                "魔之泪弹",
                "将角色的泪弹替换为{{ColorRed}}帧伤穿透血球{{CR}}#{{Damage}} 血球初始造成75%伤害, 每次碰撞会减少伤害",--吃弹速
                --突变现在的初始伤害削弱为(150% -> 75%), 伤害削减更快
                {CONF={
                    {{118,68},"BrimBrim"},
                    {395,"Xtation"},
                    {52,"DrMutation"},
                    {{114,579,533},"Overridden","Overrides"}
                }}
            },{
                "Wedding Ring",
                "妈妈的结婚戒指",--因为属于妈妈套装所以加了前缀
                "你感受到了它的气场",
                "{{ArrowUp}} {{Tears}}+0.3 射速#在角色周围生成一个光环, 捕捉角色的泪弹并使其环绕角色#松开攻击键朝指定方向释放所有环绕泪弹#按住丢弃键使其不再捕捉泪弹",
                {CONF={
                    {395,"weddingX"},
                    {{118,114},"Bringstone"},
                    {52,"DrWedding"},
                    {329,"Wedovice"}
                }}
            },{
                "Monocle",
                "单片镜",
                "泪弹放大",
                "盘旋在角色面前, 放大角色的泪弹#↑ 放大的泪弹获得{{Damage}}1.5x 伤害和{{Shotspeed}}弹速提升",
            },{
                "Enlightenment",
                "启蒙",
                "无限制的智慧",
                "5% 的概率将被杀死的敌人变为{{ColorPink}}原质{{CR}}#原质环绕角色, 造成4点碰撞伤害或抵挡3次敌弹#{{Luck}} 幸运8: 30%"--Sephiroth 翻译存疑(总不能真翻成萨菲罗斯吧
            },{
                "Demon's Eye",
                "恶魔之眼",
                "凝视黑暗",
                "从屏幕外出现透明泪弹跟随角色#造成{{Damage}}3.5伤害, 触碰角色后消失"
            },{
                "Calotte",
                "圆顶帽",
                "保持信心, 孩子",
                "↑ {{Shotspeed}}+0.5 弹速#泪弹留下伤害拖尾"
            },{
                "Carrion",
                "腐肉",
                "常年腐败",--存疑
                "{{Poison}} 泪弹施加中毒, 且环绕数个更小的泪弹#小泪弹具有灵体效果, 造成{{Damage}}4%-7%伤害",
                {CONF={
                    {{118,68},"Carriology"},
                    {579,"Carriord"}
                }}
            },{
                "Plastic Knife",
                "塑料刀",
                "伤害上升",
                "{{ArrowUp}} {{Damage}} 获得两种攻击力提升的方案, 选择最高的一种#0.8x + 1#1x + 0.6"
            },{
                "Testament",
                "遗嘱",
                "最后的愿望",--存疑, 因为两者都有遗嘱的意思, 但又不可能写重复的, 前者多义词又不好挑
                "受到伤害的心会脱落并爆裂#每种心有不同的效果"
            },{
                "Champion Mush",
                "精英蘑菇",
                "耐杀王",
                "角色获得一个随机的{{ColorRainbow}}精英变种效果{{CR}}#每隔一段时间替换效果"
            },{
                "Old Clock",
                "老式落地钟",
                "时间流逝...",
                "角色每次发射泪弹, 朝另一个方向发射额外的泪弹#方向会\"顺时针\"变化",
                {CONF={
                    {395,"Clox"},
                    {114,"Clocknife"},
                    {579,"Swock"}
                    --{329,"以悬浮泪弹为中性周期性顺时针发射泪弹"} 没测出来, 存疑
                }}
            },{
                "Purple Skull",
                "紫色头骨",
                "受诅咒者将听命于你",
                "三个诅咒魂火环绕角色或角色的泪弹/攻击#造成{{Damage}}2点碰撞伤害",
                {BFF="伤害翻倍",
                CONF={
                    {118,"Brimskull"},
                    {68,"Sknology"}
                }}
            },{
                "Can Of Tar",
                "焦油罐头",
                "胶粘泪弹",
                "10% 的概率发射{{ColorBlack}}焦油泡{{CR}}#焦油泡落地后不会消失#短时间后/发生碰撞后会崩裂为一串泪弹#{{Luck}} 幸运10: 50%",
                {CONF={
                    {118,"BrimTar"},--攻击方式全是百分百触发, 特效流就像个小丑(
                    {68,"PrimitiveCannotUseTechLOL"},
                    {395,"Tarx"},
                    {{114,329},"TarKnife"},
                    {579,"SworaT"}
                }}
            },{
                "Card Game",
                "桌游",
                "可惜没朋友跟我一起玩...",--花钱买了个桌游模拟器, 结果只能自娱自乐    天哪这简直就是我!
                "{{ColorFade}}捏他: 以撒的结合-四魂(桌游{{CR}}#生成四魂卡牌各一张: 一张宝藏卡, 一张怪物卡, 一张物资卡#更容易获得四魂卡牌"
            },{
                "Schizophrenia",
                "精神分裂",
                "我看到了我的邪念",
                "在随机位置生成妄想之形, 朝敌人发射跟踪泪弹#靠近角色的妄想之形会更弱#{{ColorFade}}更近的妄想之形会被驱散{{CR}}",--我喜欢这个道具=)
                {BFF="伤害翻倍"}
            },{
                "Inner Demon",
                "内在妖魔",
                "漆黑的内心",
                "{{Fear}} 受到伤害会推开所有敌人并施加恐惧#同时角色朝各个方向释放大量短程灵魂泪弹",
                {BFF="伤害翻倍"}
            },{
                "Followers",
                "魔之信徒",
                "它们的数量在不断增长",
                "发射普通泪弹的魔之信徒跟班, 造成{{Damage}}2.8伤害#{{ColorFade}}每有一个其他随从, 额外获得一个魔之信徒跟班{{CR}}",
                {BFF="伤害翻倍"}
            },{
                "Dead Womb",
                "死宫",
                "死产射击",
                "7%的概率发射胎儿泪弹, 接触后生成一个死胎#死胎会环绕敌人, 抵挡任意敌弹#一段时间后爆炸#{{ColorBlind}} 生命值取决于泪弹的伤害(存疑#{{Luck}} 12幸运: 16%",
                {BFF="死胎额外获得25%的生命和爆炸伤害"}
            },{
                "Keeper's Noose",
                "店主的绳索",
                "唯一的出路",
                "进入新房间后, 房间内的每有一个敌人生成一个蓝苍蝇"--不是超凡升天?不是超凡升天??
            },{
                "Soaked Sponge",
                "浸湿的海绵",
                "射速上升 + 你感到焕然一新",
                "{{ArrowUp}} {{Tears}}+0.5 射速#{{Collectible486}} 角色受到伤害后迅速受到额外的两次假伤害#角色每次受到伤害将会朝随机方向发射一连串泪弹"
            },{
                "Lamb Skull",
                "羔羊头骨",
                "献给上帝",
                "{{ColorFade}}在角色身边获得黑暗气场{{CR}}#在黑暗气场内死亡的怪物会变为黑暗之灵#黑暗之灵会追击敌人, 造成至多3次{{Damage}}7点伤害",
                {BFF="黑暗之灵伤害翻倍"}
            },{
                "God's Wrath",
                "上帝之怒",
                "雷云压城城欲摧",--暂定
                "随机生成一个可操控的十字准心#一段时间后在瞄准的位置天打雷劈#{{GarlinIcon}} 不会伤害角色",
                {CONF={
                    {{140,209,220,256,353,367,432,563,614,646},"BombSyn"},
                    {{106,366,727},"NoEffect"}
                }}
            },{
                "Apollyon's Horns",
                "亚玻仑的角",
                "你感到虚无",
                "{{Collectible477}} 进入下一层后, 吸收上一层未拾取的道具#↑ 被吸收的道具提供两个随机属性提升"
            },{
                "Golden Cross",
                "黄金十字架",
                "赞美吾主",
                "10%的概率发射{{ColorYellow}}黄金泪弹{{CR}}#{{Collectible331}} 被命中的敌人获得神性光环, 伤害附近的敌人#{{Luck}} 12幸运: 50%",
                {CONF={"5.350.78","GodClock"}}
            },{
                "Paimon's Mark",
                "派蒙之印",--派蒙乃所罗门王72柱魔神中排第9位的魔神, 位阶为君王(不然你以为是哪个派蒙?
                "幕后的提线者",--存疑
                "{{BlackHeart}} +1黑心#敌人会被拉向机关和炸弹#{{ColorFade}}捏他: Hereditary"
            },{
                "Dragon Scales",
                "龙鳞",
                "伤害上升 + 安全感",
                "{{ArrowUp}} {{Damage}}+1.5 伤害#{{HolyMantle}} 每层角色可以抵消至多3次伤害#进入下一层恢复一次抵消次数#!!! 失去所有次数将失去该道具#{{ArrowDown}} {{Damage}}每失去一次抵消次数, -0.4伤害增益"
            },{
                "Corporeal",
                "物质存在",
                "洁身自好",--存疑
                "{{SoulHeart}} +1 魂心#未命中角色的敌弹落地后会对敌人造成伤害",--什么反向鄂南连击
                {CONF={522,"CorpoTele"}}
            },{
                "Monster Cell",
                "怪人细胞",
                "就着下饭菜一起吃",--存疑 
                "↑ 体型上升#{{ArrowUp}} {{Damage}} +2 伤害#{{ArrowUp}} {{Speed}} +0.3 移速#↑ {{BlackHeart}} +2 黑心#受伤失去{{HalfHeart}}红心不再减少{{DevilChance}}恶魔房出现率#{{Warning}} 角色再也无法拾取{{Heart}}红心#{{GarlinIcon}} 直接回复红心的道具仍有效#{{ColorFade}}捏他: 一拳超人{{CR}}"--然后第二天索尼克闹肚子了(
            },{
                "Gray Fruit",
                "灰色水果",--存疑
                "全属性提升 + 更好的道具",
                "#{{Heart}} +1心之容器#{{ArrowUp}} {{Tears}}+0.3射速#{{ArrowUp}} {{Speed}}+0.15移速#{{ArrowUp}} {{Range}}+2.5射程#{{ArrowUp}} {{Shotspeed}}+0.1弹速#↑ 体型上升#低于{{Quality2}}的道具有20%的概率被重随#{{ColorFade}}捏他: Grayfruit{{CR}}"
            },{
                "Reanimator",
                "活死人药剂",
                "死亡仅是起点",--直译:死而复生
                "杀死乞丐将其变为{{RottenBeggar}}腐烂乞丐#部分乞丐死亡后有特殊效果"
            },{
                "Cuisine",
                "佳肴",
                "主菜",
                "↑ {{Heart}}+1 心之容器#{{RottenHeart}} +4 腐心"
            },{
                "Green Cap",
                "绿盖蘑菇",
                "伤害 + 射程上升?",
                "{{ArrowUp}} {{Damage}}+0.3伤害#{{ArrowUp}} {{Range}}+2.5射程#抛物线弹道"
            },{
                "Colitis",
                "结肠炎",
                "根本停不下来",
                "角色同时朝身后发射{{ColorOlive}}屎块{{CR}}#命中屎块的泪弹会重新瞄准最近的敌人或其他屎块"
            },{
                "Blessing",
                "命运之佑",
                "头顶强运",--存疑
                "5%的概率发射{{ColorYellow}}1.5倍伤害的泪弹{{CR}}#{{Luck}} 每次生效时在当前房间内获得一定的幸运上升, 至多20#{{Tears}} 上升的数值取决于射速#{{Luck}} 幸运30: 50%"
            },{
                "Mephisto's Pact",
                "墨菲斯托的契约",
                "交易达成!",
                "可以斜向冲刺并造成{{Damage}}12伤害的墨菲斯托之仆#↑ 每层翻倍, 并提出一个命令(例如: 禁用炸弹, 禁止受伤或捡起生命#!!! 违约会将其惹怒, 追杀角色直到命中或进入下一层, 然后失去所有墨菲斯托之仆",--Mephisto意为诱惑者, 不过大概是有典故的, 例如 浮士德 中有出现过墨菲斯托是撒旦派来诱惑浮士德的形象
                {BFF="墨菲斯托之仆的伤害翻倍"}
            },{
                "Wealthy Heart",
                "富裕之心",
                "我很仁慈",
                "↑ {{Heart}}+1心之容器#{{GoldenHeart}} +1金心#{{Beggar}} 乞丐有概率提供额外的奖励"
            },{
                "Fire And Ice",
                "冰火两重天",
                "水火不相容",
                "生成一个{{ColorCyan}}冰{{ColorRed}}火{{CR}}双拼区域#{{CurseBlind}} {{ColorRed}}火区{{CR}}{{Burning}}灼烧敌人, 而{{ColorCyan}}冰区{{CR}}减速并最终{{Freezing}}冻结敌人(存疑)"--冰火双拼火锅!再来个土锅就是喧嚣了(
            },{
                "Lums",
                "Lums",
                "千分之一",--存疑
                "每层会有10个lum分散到楼层各处#收集所有的lum获得随机掉落物奖励#{{ColorFade}}捏他: 镭射超人2-大脱走"
            },{
                "Psychedelic Spores",
                "迷幻孢子",
                "感觉良好",
                "8% 的概率发射孢子泪弹#孢子泪弹留下如梦孢子云, 为角色提供属性提升#{{Luck}} 8幸运: 40%",
                {CONF={
                    {{68,118},"TechSpore"},
                    {395,"Xpore"},
                    {52,"DrSpore"},
                    {114,"Sporknife"},
                    {579,"Swore"}
                }}
            },{
                "Personality Split",
                "人格分裂",--无意ky                某某游戏玩家特有的有多个人格
                "每天都是不同的身份",
                "每个房间生成2-3个人格面具#角色看向的人格面具会为角色提供各异的特殊效果"
            },{
                "Primordial Sin",
                "原罪",
                "万恶之源",
                "+10 诅咒值#获取双倍的诅咒值, 并降低受诅敌人出现时的诅咒值#{{Damage}} 每个被杀死的{{ColorRed}}受诅变种敌人{{CR}}提供永久的+0.02伤害"
            },{
                "Scrapheap",
                "废料堆",
                "打捞回来的材料",
                "持有时, 宝箱房每有一个道具, 生成一个废料堆的复制",
                --{CONF={LNF.CollectibleType.SCRAPHEAP,"Multiless"}}
            },{
                "Mental Breakdown",
                "精神崩溃",
                "临界",
                "{{Tears}} 角色与敌人靠得越近, 射速越高#拉开距离后增益迅速衰减"
            },{
                "Battery Bag",
                "电池袋",
                "储能",
                "{{Battery}} 如果主动道具无需继续充能, 允许角色继续收集并储藏小电池#至多可储存9个电池#可以按住丢弃键取出电池#{{Battery}} 拾取时, 生成一个随机电池"
            },{
                "Rotten Potato",
                "烂土豆",
                "生命 + 伤害上升","{{Heart}} +1 心之容器#{{ArrowUp}} {{Damage}} +0.5伤害#{{RottenHeart}} +1腐心#{{Battery}} 为持有的主动道具恢复所有充能"--土  豆  电  池
            },{
                "Cool-Drink",
                "冷\"酷\"饮品",
                "它很好, 但它其实不好",--阿诺文学怎么写啊学不来(
                "↑ {{Damage}}+1伤害#↑ {{Speed}}+0.2移速#{{EmptyHeart}} {{ColorYellow}}排空1-3个心之容器{{CR}}#不致死"
            },{
                "Carrot Sticks",
                "萝卜条",
                "对你好",--差点就想填"营养补上了,饱饱的"
                "↑ {{Heart}}+1心之容器#↑ {{Range}}+1.25射程#{{Heart}} 治疗2红心"
            },{
                "Sugared Cereal",
                "加糖麦片",
                "豪吃",
                "{{ArrowUp}} {{Luck}}+1幸运#{{ArrowUp}} {{Speed}}+0.2移速"
            },{
                "Rations",
                "军粮",
                "够撑几天的",
                "{{ArrowUp}} {{Damage}}+0.25伤害#{{HalfHeart}} 获得半颗心#每通过2层额外获得0.25伤害和{{HalfHeart}}"
            },{
                "Dry Biscuit",
                "饼\"干\"",
                "有点变味了",
                "{{Heart}} +1心之容器#进入新楼层后, 将{{HalfHeart}}和{{HalfSoulHeart}}补满"
            },{
                "Branding Iron",
                "品牌烙铁",--据说有用烙铁烫牛用来标志品牌的情况
                "哦哦哦!",
                "↑ {{Tears}}+0.3射速#↑ {{Speed}}+0.2移速#{{Collectible486}} 拾取后对角色造成6次假伤"
            },{
                "Stinger",
                "蜂刺",
                "区-衣-愿",--存疑  Ho-pit-l = Hospital?
                "{{ArrowUp}} {{Tears}}+0.7射速"
            },{
                "Fragile Strength",--感谢我有个玩空洞的损友(bushi
                "易碎力量",
                "脆弱的护符",
                "↑ {{Damage}}1.6x伤害#{{ArrowDown}} {{Damage}}受到伤害后伤害倍率变为0.9x#{{Shop}} 角色可以通过在商店购买该物品修复伤害增幅#!!! 每次恢复都会涨价#{{ColorFade}}捏他: 空洞骑士{{CR}}"
            },{
                "Broken Strength",
                "破碎力量",
                "已碎的护符",
                "↓ 弄碎了吧, 你瞧, 伤害还倒扣了#{{Shop}} 请去商店修好它"
            },{
                "Blood Ball",
                "血球",
                "血凝伙伴",
                "在房间内斜向运动的跟班#碰撞敌人后崩裂为泪弹#一段时间后复原",
                {BFF="伤害翻倍"}
            },{
                "Lil Guardian",
                "小守护天使",
                "TA正在看着你",--祂 字体不兼容(悲
                "飞到房间顶部, 并尝试用一束标记光线竖向瞄准角色的随从#随机朝下方发射光柱",
                {BFF="伤害翻倍"}
            },{
                "Lil Forsaken",
                "小遗忘者",
                "突然消失的伙伴",
                "隐形并在房间内高速斜向运动#造成伤害时短暂显形并降低移速",
                {BFF="伤害翻倍"}
            },{
                "Tree Of Life",
                "生命之树",
                "无尽之源",
                "高速在房间内运动的跟班#角色站在其范围内将无视敌人的伤害"
            },{
                "Lil Maw",
                "小口怪",
                "黑暗冲锋者",
                "朝角色攻击方向冲刺的跟班#可以穿过房间墙壁, 并从另一头出现, 不断重复#回到角色身边时停止并准备下一次冲刺",
                {BFF="伤害翻倍"}
            },{
                "Divided Baby",
                "分裂宝宝",
                "两极分化",--存疑
                "两个跟班#{{ColorCyan}}其中一个跟随角色, {{ColorRed}}另一个在房间内斜向移动{{CR}}#两者若发生触碰, 对房间内所有敌人造成伤害#对靠近的敌人造成额外伤害",
                {BFF="伤害翻倍"}
            },{
                "Munitus Baby",
                "天门冬宝宝",
                "他被保护的很好",
                "这个跟班和随身携带的更弱的跟班一同发射泪弹, 造成伤害并抵挡敌弹#更多的披甲宝宝道具只能增加更弱的跟班的数量",
                {BFF="伤害翻倍"}
            },{
                "Dry Bones",
                "干骨",
                "我看到了山谷",
                "在角色附近生成四个方向的干骨, 伤害接触的敌人的跟班#释放攻击键将它发射出去, 造成更高的伤害#会插在墙上卡住一段时间, 然后回归",
                {BFF="伤害翻倍"}
            },{
                "Ladygrub",
                "集美蛆",--备选描述:家人们水洞啊这个下头怪竟然打我集美门快去集火这个渣男
                "你不会伤害她的, 对吧?",--你知道的, 我一向喜欢残忍屠杀蛆虫(
                "在房间内游走的跟班#{{Charm}} 碰到的敌人被短暂魅惑#{{Bait}} 用泪弹攻击该跟班的敌人会被标记并被集火"
            },{
                "Mashy",
                "破壳之糊",--存疑
                "你也不想被夹在中间吧",
                "一个由两个可以造成伤害的石壳, 中间由弹性糊状肉连接的跟班#敌人碰到糊状肉会导致两个石壳呈两面包夹之势夹击敌人造成伤害",
                {BFF="伤害翻倍"}
            },{
                "Drizzle Maker",--drizzle 毛毛细雨
                "细雨人",
                "掌声有请",
                "{{Collectible572}} 持续发射可控泪弹的跟班#{{Damage}} 每个泪弹伤害为5.6",
                {BFF="伤害翻倍"}
            },{
                "Revenant's Head",
                "还魂骷髅头",
                "装满灵魂的头骨",
                "环绕角色并造成伤害的跟班#当它杀死敌人后会燃起来, 与角色同一方向发射紫火"
            },{
                "Fruit of Eden",
                "伊甸园的智慧之果",
                "禁果",
                "环绕角色的跟班, 会尝试与最近的敌人保持一条线#立即杀死每个房间第一个碰到的敌人, 然后变为造成碰撞伤害的果核",
                {BFF="果核伤害翻倍"}
            },{
                "Low Priest",
                "下级祭司",--翻译软件只有High priest(高级祭司), 和游戏里的High priestess(女祭司)
                "他试过了",
                "环绕角色并朝一个方向发射泪弹的跟班#每个房间改变方向#{{Damage}} 造成角色一半的伤害, {{Tears}}与角色共享射速",
                {BFF="伤害翻倍"}
            },{
                "Robo-Baby X",
                "机器宝宝X",
                "新一代科技",
                "在房间内斜向运动的跟班, 环绕激光环",
                {BFF="伤害翻倍"}
            },{
                "Mark I",
                "机器印记",
                "老伙计",
                "进入房间后, 在每个敌人周围制造激光环#{{ColorFade}}激光环会逐渐变小直至消失{{CR}}",
                {BFF="伤害翻倍"}
            },{
                "Glass Heart",
                "玻璃心",
                "别弄碎了",
                "{{SoulHeart}} +1魂心#{{Warning}} 受伤后破碎",
                {VIR="若有至少一个玻璃心魂火, 则摧毁所有魂火以阻止破碎"}
            },{
                "Broken Glass Heart",
                "破碎玻璃心",
                "你又给它弄碎了",
                "充能填满后使用变回玻璃心"
            },{
                "Epidemic",
                "传染病",
                "决定它们的生死",
                "生成一个可控制的准心, 持续留下{{ColorLime}}绿色液迹#{{ColorYellow}}一段时间后在准心的位置释放一大片黄色液迹{{CR}}",
                {CAR="准心的持续时间翻倍",
                VIR="不会攻击, 留下伤害液体的魂火"}
            },{
                "Anthrax",
                "炭疽",
                "给他们想要的",
                "使用后, 将靠近角色的敌人感染, {{ColorRed}}一段时间后{{CR}}会迸裂成血与骨",
                {CAR="生效范围翻倍",
                VIR="魂火熄灭后, 附近的非头目敌人失去当前生命的一半"}
            },{
                "Gong",
                "锣鼓",--为社么EID连锣字都不兼容啊
                "开战!",--向萌死戳!开战!向大白蛆!开战!向老妈!开战!向双目硫磺火!开战!向凹凸!开战!向百变怪!开战!钦此
                "{{ChallengeRoom}} 传送至一个独立的挑战房",
                {CAR="没有效果",
                VIR="魂火会将碰到的敌人变为变种形态"}--跟隔壁犹大长子权墨池坐一桌
            },{
                "Cupid's Bow",
                "丘比特之弓",
                "恋情, 命中注定",
                "将敌人两两组队#组队的敌人共享受到的伤害",
                {CAR="没有效果",
                VIR="发射穿透泪弹的魂火, 碰到魂火的敌人被随机结伴",
                CONF={48,"TrueCupid"}}
            },{
                "Dad's Hammer",
                "爸爸的锤子",
                "把敌人钉住",
                "对所有敌人造成5伤害#将非头目敌人钉住6s#{{CurseBlind}} 将头目的加速度归零(存疑)",
                {CAR="敌人被钉住的时间翻倍",
                VIR="发射钉子泪弹的魂火, 熄灭后钉住一些敌人"}
            },{
                "Isaac's Toys",
                "以撒的玩具",
                "爸爸留给我的东西",
                "{{Collectible}} 丢下一个持有的随机被动道具, 并额外生成一个宝箱房道具#{{ColorYellow}}只能拾取其中一个{{CR}}",
                {CAR="生成第三个道具作为选择",
                VIR="魂火碰到道具底座后会额外生成一个道具底座供选择其中一个"}
            },{
                "Moirai String",
                "摩伊赖之线",--希腊神话中三位命运女神的统称，她们是宙斯和提坦女神忒弥斯的女儿
                "命运在你手中",
                "对每个曾受到过伤害的敌人造成10点伤害",
                {CAR="伤害翻倍",
                VIR="低于一半生命的敌人碰到魂火会被秒杀"}
            },{
                "Gospel Of Judas",
                "犹大福音",--《犹大福音》，是一本以科普特文记载的诺斯底主义该隐派福音书卷
                "谎言流淌",
                "吞噬一个随机的商店/恶魔交易道具, 将其变为一个跟班#{{ColorRed}}无伤将该道具充能重新填满后{{CR}}, 奖励那个道具的2个复制#{{GarlinIcon}} 请保持持有这个道具以获取奖励!",
                {CAR="没有效果",
                VIR="所有魂火在角色受到伤害后消失",--你个废物
                CONF={477,"NoEffect"}}
            },{
                "Dissolving Cat",
                "溶解猫",
                "嗯...化学味的",--存疑
                "生成2-4个氰苍蝇, 它们会留下伤害性液体#{{ColorFade}}捏他: Chemicat{{CR}}",
                {VIR="留下伤害性液体的魂火"}
            },{
                "Dedal's Blueprint",
                "精密的蓝图",
                "迷宫地图",--存疑
                "将角色传送到离自己最近的门后的房间内",--这东西配2???
                {CAR="没有效果",
                VIR="魂火熄灭后打开一个随机房门"}
            },{
                "Gross Remote",
                "糜烂的遥控器",
                "生物科技",
                "持有时, 生成一个刺球跟班, 左右移动并造成伤害#{{GarlinIcon}} 该跟班无视障碍物#使用后将刺球的移动方向改变90度",
                {CAR="没有效果",
                VIR="在刺球的位置生成一个持续7s的固定魂火"}
            },{
                "Cursed Gem",
                "诅咒宝石",
                "心想事成",
                "杀死房间内的所有敌人#{{Warning}} +1 诅咒值#当诅咒值达到50或以上, 移除所有的道具底座",
                {CAR="没有效果",
                VIR="不会攻击, 秒杀碰到的敌人的魂火"}
            },{
                "Cursed Dice",
                "诅咒骰子",
                "有偿重随",
                "{{Collectible105}} 重随道具#{{Warning}} 每重随一个道具+1诅咒值",
                {CAR="没有效果",
                VIR="增加更多的诅咒值, 并生成2个魂火"}
            },{
                "Prescription",
                "处方",
                "该喝药了",--大郎
                "{{Pill}} 消耗一个药丸, 在不触发效果的情况下透视其效果#有30%的概率返还该药丸",
                {VIR="魂火熄灭后有20%的概率识别持有的药丸",
                CONF={{75,46,303,654},"PillMaster"}}
            },{
                "Robot's Battery",
                "机器人电池",
                "模块化功能",
                "杀死敌人有概率掉落随机模块#使用后, 激活所有装填的模块#可以按住{{ButtonRT}}丢下模块",
                {VIR="魂火熄灭后有20%的概率生成随机模块"}
            },{
                "Workshop",
                "工坊",
                "正在更新!",
                "在举重时使用将道具拆解成数个掉落物",
                {CAR="拆解获得双倍掉落物",
                VIR="将被拆解的道具变为对应的道具魂火"}
            },{
                "Nightmare Fuel",
                "噩梦能源",
                "充能形恐惧",
                "{{ColorMaroon}}开启噩梦模式, 在房间内持续生成噩梦尸追杀角色#{{ColorMaroon}}杀死噩梦尸会伤害附近的敌人#{{ColorMaroon}}部分道具会引发特殊的变种噩梦!#{{ColorMaroon}}被噩梦尸触碰会中止噩梦模式{{CR}}#!!! 噩梦尸不会对角色造成伤害, 这只是一场梦...",
                {CAR="更频繁出现噩梦尸",
                VIR="仅在噩梦中有效的魂火"}
            },{
                "Moon Rock",
                "月石",
                "祝好梦",
                "进入梦境模式, 并将所有大于70%生命的敌人变为{{ColorRainbow}}梦境变种#!!! {{ColorRainbow}}梦境变种的敌人具有两倍的行动速度{{CR}}#杀死梦境变种敌人后, 基于敌人的生命值在梦境模式下提供小幅度属性提升",
                {CAR="将大于50%生命的敌人变为梦境变种",
                VIR="仅在梦境模式有效的魂火"}
            },{
                "Hot Rocks",
                "烫手山石",--本来想看图写话火石的,但转念一想:诶(笑脸emoji+手指上指
                "好烫好烫好烫!",
                "{{ArrowUp}} {{Damage}}持有时获得1.3x伤害倍率#{{Warning}} 每3分钟对角色造成一次伤害#替换掉该道具可以重置计时#或者通过使用道具丢掉一块石头以重置计时",
                {CAR="没有效果",
                VIR="如果角色没有剩余的烫手山石则失去所有魂火",
                CONF={477,"NoEffect"}}
            },{
                "Two Hot Rocks",
                "还剩2个烫手山石",
                "哎哟好烫!",
                "{{ArrowUp}} {{Damage}}持有时获得1.3x伤害倍率#{{Warning}} 每3分钟对角色造成一次伤害#替换掉该道具可以重置计时#或者通过使用道具丢掉一块石头以重置计时",
                {CAR="没有效果",
                VIR="如果角色没有剩余的烫手山石则失去所有魂火",
                CONF={477,"NoEffect"}}
            },{
                "One Hot Rock",
                "最后1颗烫手山石",
                "啊烫!",
                "{{ArrowUp}} {{Damage}}持有时获得1.3x伤害倍率#{{Warning}} 每3分钟对角色造成一次伤害#替换掉该道具可以重置计时#或者通过使用道具丢掉一块石头以重置计时#但接下来你没有剩下的石头了",
                {CAR="没有效果",
                VIR="如果角色没有剩余的烫手山石则失去所有魂火",
                CONF={477,"NoEffect"}}
            },{
                "Blood Shrine",
                "嗜血神龛",--太棒了又是字体不兼容我完蛋了
                "再献上一次鲜血",
                "↓ 移除1{{Heart}}心之容器或3{{SoulHeart}}, 生成一个嗜血神龛#角色受到致命伤害时, 将他传送至神龛的位置并复活#持续一层",
                {CAR="没有效果",
                VIR="生成3个魂火#复活后拥有至少3个魂火"}
            },{
                "Animatronic's Mask",
                "机器熊面具",
                "没什么好怕的, 我的孩子",
                "使用后戴上面具#{{Confusion}} 戴着面具的角色不会被怪物发现, {{Warning}}但也无法攻击#一段时间后自动摘下面具#{{ColorFade}} 捏他: 玩具熊的五夜后宫",
                {CAR="没有效果",
                VIR="生成2个魂火, 在摘下面具后消失"}
            },{
                "Red Mass",
                "红色诡团",
                "窥见恐惧的真容",
                "有概率杀死随机敌人, 其有15%的概率掉落{{Heart}}#{{Warning}} 否则让角色受到伤害#{{ColorFade}}捏他: Psycho Streamer{{CR}}",
                {CAR="没有效果",
                VIR="秒杀碰到的敌人的魂火"}
            },{
                "Dynamite",
                "炸药",
                "精心布置",
                "生成至多5个爆竹#角色离开上一个爆竹的有效区域后才能放置下一个爆竹#布置好所有的爆竹后, 它们会在角色不在其爆炸范围时爆炸",
                {CAR="放置双倍数量的爆竹",
                VIR="魂火熄灭后生成一个爆竹"}
            },{
                "Tube Milk",
                "吸吸奶",--看到我就想到那个什么可以吸的冰淇淋但我忘了那叫什么了   
                "牛奶上升",
                "{{Collectible330}} 获得会逐渐衰减的高射速和低伤害",
                {VIR="魂火可以共同得到该道具的射速增益"}
            }, 
        }
        trinkets={
            {
                "Spider Leg",
                "蜘蛛腿",
                "它跑得更快了",
                "增加蓝蜘蛛的移速",
                {GOLD={INFO={append=true},TEXT={"进一步增加移速","进一步增加移速","进一步增加移速"}}}
            },{
                "Gift of Myrrh",
                "没药之礼",--是的没药是一个热带树脂的名字
                "赐予人类",
                "可以在清理房间后完全清除诅咒值#{{Heart}} 每层生成一红心",--存疑
                {GOLD={INFO={append=true},TEXT={"生成额外的{{Heart}}","生成额外的{{Heart}}","生成额外的{{Heart}}"}}}
            },{
                "Gift of Gold",
                "黄金之礼",
                "赐予王者",
                "增加的诅咒值减半#{{Coin}} 每层生成一个硬币",
                {GOLD={INFO={append=true},TEXT={"生成额外的{{Coin}}","生成额外的{{Coin}}","生成额外的{{Coin}}"}}}
            },{
                "Gift of Frankincense",
                "乳香之礼",
                "赐予吾主",
                "受诅之物需要更高的诅咒值才会出现#{{Key}} 每层生成1钥匙",
                {GOLD={INFO={append=true},TEXT={"生成额外的{{Key}}","生成额外的{{Key}}","生成额外的{{Key}}"}}}
            },{
                "Procession",
                "圣灵流出",--存疑
                "我们心怀信仰在此游荡",
                "每层离初始房间最近的房间会被清理",--谁几把问你了?
                {GOLD={INFO={append=true},TEXT={"清理更多房间","清理更多房间","清理更多房间"}}}
            },{
                "Ritual Candle",
                "仪式烛",
                "与恶魔交易",
                "受诅敌人会随时间受到伤害",
                GOLD={INFO={append=true},TEXT={"伤害增加","伤害增加","伤害增加"}}
            },{
                "Gladiator's Axe",
                "罗马斗士斧",
                "他们对你产生了敬畏",
                "{{Charm}} 进入新房间后, 有概率魅惑变种敌人",
                {GOLD={INFO={append=true},TEXT={"概率上升","概率上升","概率上升"}}}
            },{
                "Motherly Love",
                "母爱",
                "我想把我最好的给你",--bro又开始幻想自己家庭美满了
                "{{BossRoom}} 每场头目战治疗3{{Heart}}#{{Warning}} {{MomBoss}}妈死了就没效了"
            },{
                "Caesar's Wreath",
                "凯撒的花环",
                "还有你, 布鲁特斯",
                "敌弹有概率打到其他敌人身上",
                {GOLD={INFO={append=true},TEXT={"概率上升","概率上升","概率上升"}}}
            },{
                "Dark Hand",
                "黑暗之手",
                "令人生疑的赞誉",
                "{{DemonBeggar}} 使用恶魔乞丐会可能让所有{{DevilRoom}}恶魔交易道具免费{{ColorBlink}}, 或者是竹篮打水一场空{{CR}}"
            },{
                "Garden Hose",
                "花园软管",
                "给敌人浇水",
                "受到伤害将屏幕内的所有泪弹一分为6"
            },{
                "Golden Bag",
                "金包裹",
                "备用金掉落物",--小调整
                "如果同一层内拾取了重复的金掉落物, 可以将其带到下一层"
            },{
                "Single Sock",
                "不成对的袜子",--致敬传奇4只袜子凑不出一双
                "它怎么在这儿",
                "2%的概率让道具在其道具池外的地方出现",
                {GOLD={INFO={append=true},TEXT={"概率上升","概率上升","概率上升"}}}
            },{
                "Cardboard House",
                "纸板屋",
                "它们应该会对这个感兴趣的",
                "清理房间有概率生成随机乞丐",--到时候清理房间再出一个陆夫人就老实了(
                {GOLD={INFO={append=true},TEXT={"概率上升","概率上升","概率上升"}}}
            },{
                "Smooth Dice",
                "光滑的骰子",
                "太多的可能性",--存疑
                "{{Collectible166}} 每当角色捡起掉落物时有概率将房间内的其他掉落物重随",
                {GOLD={INFO={append=true},TEXT={"概率上升","概率上升","概率上升"}}}
            },{
                "Eraser Crumbs",
                "橡皮屑",
                "别碰这些孩子",--好的我不碰(吹走
                "{{Collectible638}} 擦除下一个伤害角色的敌人#!!! {{ColorYellow}}一次性{{CR}}"
            },{
                "God Tears",
                "神之泪",
                "神圣悲恸",
                "{{Collectible331}} 3%的概率发射神性泪弹#{{Luck}} 幸运6: 18%"--神性本来就被学非了你药剂吧干啥
            },{
                "Masochism",
                "受虐狂",--我差点就要把抖M写进去了(这次好像真是抖M
                "再来一次",
                "{{Collectible486}} 受伤后短时间内再受到一次假伤, 生成一片红色液迹"
            },{
                "Lapis Lazuli",
                "青金石",
                "更好的书",
                "每次使用书本都会获得暂时性小幅度伤害提升",--总感觉是捏他我的世界
                {GOLD={INFO={append=true},TEXT={"更高的伤害提升","更高的伤害提升","更高的伤害提升"}}}
            },{
                "Unsupported Module",
                "不兼容模块",
                "不适配",
                "使用主动道具后, 有概率触发任意一个角色曾经拥有过的主动道具的效果#概率基于主动道具的充能"
            },{
                "Bumbo's Coin",
                "乞丐宝的硬币",
                "无价之宝",
                "角色即将失去最后一美分时, 有50%的概率保留它"
            },{
                "Black Sheep",
                "黑绵羊",
                "并非必要",--存疑
                "一个随机的敌人会被标记为黑绵羊#清理房间时无需杀死黑绵羊",
                {GOLD={INFO={append=true},TEXT={"更多的敌人会被标记为黑绵羊","更多的敌人会被标记为黑绵羊","更多的敌人会被标记为黑绵羊"}}}
            },{
                "Comfy Pillow",
                "舒适的枕头",
                "晚安之眠",--存疑
                "10%的概率在每个房间触发梦境模式#梦境模式中, 所有敌人变为{{ColorRainbow}}梦境变种#!!! {{ColorRainbow}}梦境变种的敌人具有两倍的行动速度{{CR}}#杀死梦境变种敌人后, 基于敌人的生命值在梦境模式下提供小幅度属性提升",
                {GOLD={INFO={append=true},TEXT={"概率上升","概率上升","概率上升"}}}
            },{
                "Questionnaire",
                "问卷",
                "你会选哪个呢?",--存疑
                "进入下一层时, 根据角色的类型生成不同掉落物"
            },{
                "Nightdust",
                "噩梦尘",
                "直面你的噩梦",
                "有概率出现噩梦#{{ColorMaroon}}在房间内持续生成噩梦尸追杀角色#{{ColorMaroon}}杀死噩梦尸会导致爆炸, 炸伤附近的敌人#{{ColorMaroon}}被噩梦尸触碰会中止道具效果"
            },{
                "Rusty Weld",
                "生锈的焊缝",
                "撑不住太久",
                "{{ArrowUp}} {{Damage}} 吞下这个饰品以获得+1伤害#{{ArrowUp}} {{DamageSmall}} 否则获得+0.2伤害",
                {GOLD={INFO={append=true},TEXT={"伤害翻倍","伤害翻倍","伤害加倍"}}}
            },{
                "White Dwarf",
                "白雪小矮人",
                "光线昏暗",--存疑
                "每个房间有7%的概率让每个敌人生成一个环绕的道具魂火#这些道具魂火可以为角色提供对应效果#至多可以拥有3个道具魂火#杀死敌人会让环绕的道具魂火熄灭",
                {GOLD={INFO={append=true},TEXT={"概率上升","概率上升","概率上升"}}}
            },{
                "Pet Slug",
                "宠物鼻涕虫",
                "难养的家伙",
                "{{Collectible486}} 进入房间有25%的概率受到一次假伤",
            },{
                "Teddy Bear",
                "泰迪熊",
                "有人很想他",
                "{{ArrowUp}} {{Tears}} +0.3 射速#{{Warning}} 敌人会在已清理的房间中重生#受到伤害或进入下一层后失去该饰品"
            },
        }
        local cards={
            {
                "MonsterCard",
                "怪物卡",
                "敌军压境",
                "30% - 随机敌人#{{Collectible437}} 30% - 重新清理房间#{{BossRoom}} 20% - 一场头目战#10% - 生成一个活版门#{{CurseCursed}} 10% - 一个诅咒"
            },{
                "LootCard",
                "物资牌",
                "取一物资",
                "{{Coin}} 20% - 硬币#{{Key}} 20% - 钥匙#{{Bomb}} 20% - 炸弹#{{Heart}} 20% - 心#{{Chest}} 10% - 箱子#{{Pill}} 10% - 药丸"
            },{
                "TreasureCard",
                "道具牌",
                "丰厚奖励",
                "{{Chest}} 20% - 箱子#{{Trinket}} 20% - 饰品#{{GrabBag}} 20% - 福袋#{{GoldenChest}} 20% - 金箱子#{{Collectible}} 10% - 道具#↑ 10% - {{SoulHeart}} + {{LuckSmall}} +1 + {{DamageSmall}} +0.3"
            },{
                "Tenebris",
                "黑暗诅咒符文",
                "前途漆黑",
                "{{Collectible}} 生成当前房间道具池的两个道具#{{ArrowDown}} {{ColorRed}}下一层获得所有诅咒{{CR}}"
            },{
                "Caecus",
                "盲目诅咒符文",
                "目中无人",
                "{{Collectible691}} 当前楼层的所有小于{{Quality3}}的道具有75%的概率被重随#{{ArrowDown}} {{ColorRed}}下一层内所有高于{{Quality1}}的道具有75%的概率被重随{{CR}}"
            },{
                "Perdita",
                "失落诅咒符文",
                "一无所获",
                "{{ArrowUp}} 本层楼内将所有钥匙, 硬币, 炸弹, 心和电池翻倍#{{ArrowDown}} {{ColorRed}}下一层禁止捡起任何掉落物{{CR}}",
            },{
                "Miserere",
                "哀悼诅咒符文",
                "永无希望",
                "{{Heart}} 治疗4颗心#{{SoulHeart}} 多余的治疗量会变为魂心#{{ArrowDown}} {{ColorRed}}下一层有70%的概率将敌人翻倍{{CR}}"
            },{
                "Gigas",
                "巨兽诅咒符文",
                "荒诞不堪",
                "{{ArrowUp}} 大幅度的全属性提升#{{ArrowDown}} {{ColorRed}}下一层获得全属性降低{{CR}}#{{ArrowUp}} 再下一层恢复正常"
            },{
                "BlankCursedRune",
                "空白诅咒符文",
                "混沌一片",
                "!!! 触发随机的{{ColorRed}}诅咒符文{{CR}}效果"
            },{
                "GlyphHagalaz",
                "冰雹图腾",
                "灾变",
                "{{Bomb}} 炸掉房间内的所有敌人"
            },{
                "GlyphJera",
                "收获图腾",
                "充沛",
                "{{Collectible476}} 复制最近的掉落物N个#N等于当前房间内消耗品数量的一半(存疑)"
            },{
                "GlyphEhwaz",
                "马骑图腾",
                "传输",
                "{{Collectible660}} 生成4个通往当前楼层不同房间的传送门" 
            },{
                "GlyphDagaz",
                "朝夕图腾",
                "洗涤",
                "-10 诅咒值#将{{DevilChance}}转化为{{AngelChance}}"
            },{
                "GlyphAnsuz",
                "诸神图腾",
                "远见",
                "{{Collectible333}} 揭示下一层的地图并阻止{{CurseLost}}迷失诅咒出现#揭示当前楼层的特殊房间"
            },{
                "GlyphPerthro",
                "签筒图腾",
                "转移",
                "{{Collectible}} 丢下一个持有的随机被动道具, 并额外生成一个道具#{{ColorYellow}}只能拾取其中一个{{CR}}"
            },{
                "GlyphBerkano",
                "桦木图腾",
                "统一",
                "{{Collectible357}} 当前房间内复制所有的跟班#复制所有的蜘蛛和苍蝇"
            },{
                "GlyphAlgiz",
                "保护图腾",
                "防护",
                "{{HolyMantle}} 获得1分钟的神圣屏障"
            },{
                "GlyphBlank",
                "空白图腾",
                "???",
                "触发随机图腾的效果"
            },{
                "JosephSoul",
                "约瑟夫的魂石",
                "梦境中的力量",
                "进入梦境模式#{{ArrowUp}} 在梦境模式中获得全属性提升#生成3个月石碎片"
            },{
                "MoonShard",
                "月石碎片",
                "梦境残片",
                "触发{{Collectible"..LNF.CollectibleType.MOON_ROCK.."}}的效果#有30%的概率额外生成一个月石碎片"
            },{
                "RobotSoul",
                "机器人的魂石",
                "力量激增",
                "触发任意一个角色曾经拥有过的主动道具的效果#如果未拥有过任何主动道具, 生成一个{{Battery}}超级电池"
            }
        }
        local pill={
            {
                LNF.PillEffect.PENICILIN,
                "盘尼西林",
                "{{Heart}} 治疗1红心#获得1s无敌"
            },{
                LNF.PillEffect.INFESTED3,
                "寄生...",
                "将所有掉落物变为蜘蛛"
            },{
                LNF.PillEffect.PSYCHOSIS,
                "精神错乱",
                "复活房间内的所有敌人并将其变为变种"
            }
        }
        local other={
            {
                5,LNF.PickupVariant.PICKUP_MODULE,LNF.ModuleSubtype.DAMAGE_MODULE,
                "伤害模块",
                "{{Damage}} 获得临时的+0.7攻击力"
            },{
                5,LNF.PickupVariant.PICKUP_MODULE,LNF.ModuleSubtype.FIRERATE_MODULE,
                "射速模块",
                "{{Tears}} 获得临时的+0.3射速"
            },{
                5,LNF.PickupVariant.PICKUP_MODULE,LNF.ModuleSubtype.MOBILITY_MODULE,
                "机动模块",
                "{{Speed}} 获得临时的+0.移速#{{Range}} 获得临时的+2.5射程#{{Shotspeed}} 获得临时的+0.1弹速"
            },{
                5,LNF.PickupVariant.PICKUP_MODULE,LNF.ModuleSubtype.SHIELD_MODULE,
                "护盾模块",
                "{{HolyMantle}} 在当前房间内抵挡一次伤害"
            },{
                5,LNF.PickupVariant.PICKUP_MODULE,LNF.ModuleSubtype.BOMB_MODULE,
                "炸弹模块",
                "在角色的位置释放爆炸"
            },{
                5,LNF.PickupVariant.PICKUP_MODULE,LNF.ModuleSubtype.SAD_MODULE,
                "哭脸模块",
                "{{Tears}} 获得迅速衰减的+4射速, 并朝周围发射一圈泪弹"
            },{
                5,LNF.PickupVariant.PICKUP_MODULE,LNF.ModuleSubtype.COPY_MODULE,
                "模仿模块",
                "额外触发另一个持有的随机模块的效果"
            }--道具模块不加了,反正也有道具效果EID汉化给你看
        }
        local conditionalList={
            CorpoTele="反弹的子弹在击中气体敌人后并不会触发效果",
            TrueCupid="下一发攻击会让房间内的所有敌人共享受到的伤害",
            NoEffect="没有效果",
            PillMaster="必定生成药丸, 且有30%的概率额外获得一个复制",
            SyrupChange="额外的效果也受到药丸转换效果的影响",
            ParaditeBomb="炸弹爆炸会朝随机方向投掷蛆虫",
            AncientX="在原有攻击上环绕两个激光球",
            AncientGreatTech="额外发射的激光获得更长的射程",
            KnifeTech="刀子飞行时概率释放激光",
            AncientSword="每次挥剑都会朝斜角释放短程激光",
            HydroStone="泪弹每次弹跳也会生成更弱的水滴跟班",
            LauSis="泪弹合并时也会产生水滴跟班",
            TechSpore="激光必定沿途生成小范围孢子云",
            Xpore="在激光环内生成孢子云(存疑)",
            DrSpore="掷出的炸弹持续生成小范围孢子云",
            Sporknife="刀子飞行时概率生成小范围孢子云",
            Swore="挥剑时有概率放出小范围孢子云",
            Multiless="多个道具效果不叠加",
            BrimBrim="激光柱在命中墙体后释放数个小血球",
            Xtation="激光环持续朝四周发射小血球",
            DrMutation="炸弹被血球包裹",
            weddingX="8个血泪环绕激光环",
            Bringstone="攻击穿过光环时获得数个环绕泪弹",
            DrWedding="可以捕获角色掷出的炸弹, 这些炸弹只有主动释放出去才会引爆",
            Wedovice="可以捕获悬浮的泪弹",
            Carriology="朝激光落点发射一串小泪弹",
            Carriord="挥剑会甩出几个小泪弹, 蓄力可以积蓄更多的小泪弹",
            Clox="以激光环为中心顺时针发射激光",
            Clocknife="刀子飞行时迅速顺时针发射泪弹, 伤害取决于蓄力时间",
            Swock="旋转挥剑释放一圈剑气泪弹",
            Brimskull="魂火立即传送至激光柱落点, 并在原点与落点间连接激光",
            Sknology="魂火会被传送至激光的随机位置",--存疑, 维基描述为在激光命中后, 魂火会被传送至其位置
            BrimTar="在激光柱的尽头生成焦油泡, 它会吞噬激光柱的长度并不断变大, 与幸运无关",
            PrimitiveCannotUseTechLOL="角色在发射激光时朝前投掷焦油泡, 与幸运无关",
            Tarx="激光环中心有一个成长的焦油泡, 与幸运无关",
            TarKnife="飞行时间歇性地落下焦油泡",
            SworaT="挥剑时甩出焦油泡",
            BombSyn="兼容炸弹特效",
            GodClock="延长敌人身上的神性光环的持续时间"
        }
        mod:AddToConditionalList(conditionalList)
        for _, item in ipairs(items) do
            mod:AddTranslate(100, item[1], item[2], item[3], item[4], item[5])
        end
        for _, item in ipairs(trinkets) do
            mod:AddTranslate(350, item[1], item[2], item[3], item[4], item[5])
        end
        for _, item in ipairs(cards) do
            mod:AddTranslate(300, item[1], item[2], item[3], item[4], item[5])
        end
        for _, item in ipairs(pill) do
            mod:AddTranslate(70,item[1],item[2],"empty",item[3],item[4])
        end
        for _, item in ipairs(other) do
            mod:AddEntityTransl(item[1],item[2],item[3],item[4],item[5])
        end
        EID:addCharacterInfo(LNF.PlayerType.Robot,"可以拥有4个模块槽位, 每个模块消耗2充能#{{Collectible68}} 初始携带科技模块#!!! 受到伤害会随机失去一个模块#心掉落物有概率被替换为随机模块","机器人","zh_cn")
        EID:addCharacterInfo(LNF.PlayerType.TaintedRobot,"{{TreasureRoom}} 宝箱房只会出现废料堆#拾取废料堆会将其自动拆解#利用机器工坊让自己变强!#操作方式: 攻击键=选择模块; 主动键=锻造模块; 副手键=退出工坊","机器人-遗弃者","zh_cn")
        EID:addCharacterInfo(LNF.PlayerType.Joseph,"在梦境模式中获得更多的属性#一部分属性可以被带出梦境模式","约瑟夫","zh_cn")
        EID:addCharacterInfo(LNF.PlayerType.TaintedJoseph,"!!! {{ColorMaroon}}永久的噩梦#{{ColorMaroon}}被噩梦尸触碰会增加2{{BrokenHeart}}#使用噩梦能源来暂时中止噩梦并减小噩梦强度","约瑟夫-罹难者","zh_cn")
        EID:addCharacterInfo(LNF.PlayerType.Munitus,"在未清理的房间时, 随着时间流逝, 在当前房间内获得一个随机跟班","天门冬-挑战限定角色","zh_cn")
        EID:addBirthright(LNF.PlayerType.Joseph,"每次使用月石都会获得随机属性提升","约瑟夫-栩栩如生之梦","zh_cn")
        EID:addBirthright(LNF.PlayerType.Robot,"额外获得2个模块槽位","机器人-额外插口","zh_cn")
        EID:addBirthright(LNF.PlayerType.TaintedJoseph,"更快生成噩梦尸","约瑟夫-噩梦入侵","zh_cn")
        EID:addBirthright(LNF.PlayerType.TaintedRobot,"拆解道具获得更多废料","机器人-额外废料","zh_cn")
        EID:addBirthright(LNF.PlayerType.Munitus,"计时器流速减慢","天门冬-更加独立","zh_cn")--仔细一想这个角色正常也拿不到长子权还是算了吧
    end
end)
